In [1]:
import pandas as pd

pd.read_csv('C:\Users\John Lee\Documents\DataScience\Karpov_Data_Analytic\Lecture_2\material\2_taxi_nyc.csv', encoding = 'windows-1251')

In [2]:
taxi = pd.read_csv('2_taxi_nyc.csv')

In [3]:
taxi.head(13)

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp 01,pcp 06,pcp 24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
5,2015-01-01 01:00:00,Jan,Staten Island,6,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
6,2015-01-01 01:00:00,Jan,NaN,4,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
7,2015-01-01 02:00:00,Jan,Bronx,120,Y,3.0,10.0,30.0,6.0,1023.0,0.0,0.0,0.0,0.0
8,2015-01-01 02:00:00,Jan,Brooklyn,1229,Y,3.0,10.0,30.0,6.0,1023.0,0.0,0.0,0.0,0.0
9,2015-01-01 02:00:00,Jan,EWR,0,Y,3.0,10.0,30.0,6.0,1023.0,0.0,0.0,0.0,0.0
10,2015-01-01 02:00:00,Jan,Manhattan,4345,Y,3.0,10.0,30.0,6.0,1023.0,0.0,0.0,0.0,0.0
11,2015-01-01 02:00:00,Jan,Queens,331,Y,3.0,10.0,30.0,6.0,1023.0,0.0,0.0,0.0,0.0
12,2015-01-01 02:00:00,Jan,Staten Island,7,Y,3.0,10.0,30.0,6.0,1023.0,0.0,0.0,0.0,0.0

In [4]:
taxi.shape

(29101, 14)

In [56]:
taxi.shape[1]

15

In [5]:
taxi.dtypes

pickup_dt        object
pickup_month     object
borough          object
pickups           int64
hday             object
spd             float64
vsb             float64
temp            float64
dewp            float64
slp             float64
pcp 01          float64
pcp 06          float64
pcp 24          float64
sd              float64
dtype: object

In [57]:
taxi.dtypes.value_counts()

float64    10
object      4
int64       1
dtype: int64

In [6]:
taxi.describe()

,pickups,spd,vsb,temp,dewp,slp,pcp 01,pcp 06,pcp 24,sd
count,29101.000000,29101.000000,29101.000000,29101.000000,29101.000000,29101.000000,29101.000000,29101.000000,29101.000000,29101.000000
mean,490.215903,5.984924,8.818125,47.669042,30.823065,1017.817938,0.003830,0.026129,0.090464,2.529169
std,995.649536,3.699007,2.442897,19.814969,21.283444,7.768796,0.018933,0.093125,0.219402,4.520325
min,0.000000,0.000000,0.000000,2.000000,-16.000000,991.400000,0.000000,0.000000,0.000000,0.000000
25%,1.000000,3.000000,9.100000,32.000000,14.000000,1012.500000,0.000000,0.000000,0.000000,0.000000
50%,54.000000,6.000000,10.000000,46.000000,30.000000,1018.200000,0.000000,0.000000,0.000000,0.000000
75%,449.000000,8.000000,10.000000,64.500000,50.000000,1022.900000,0.000000,0.000000,0.050000,2.958333
max,7883.000000,21.000000,10.000000,89.000000,73.000000,1043.400000,0.280000,1.240000,2.100000,19.000000

In [7]:
taxi = taxi.rename(columns={'pcp 01':'pcp_01', 'pcp 06':'pcp_06', 'pcp 24':'pcp_24' })

In [8]:
taxi.temp

0        30.0
1        30.0
2        30.0
3        30.0
4        30.0
         ...
29096    75.0
29097    75.0
29098    75.0
29099    75.0
29100    75.0
Name: temp, Length: 29101, dtype: float64

In [9]:
taxi.query('borough == "Manhattan"').shape[0]

4343

In [10]:
taxi.info

<bound method DataFrame.info of                  pickup_dt pickup_month        borough  pickups hday  spd  \
0      2015-01-01 01:00:00          Jan          Bronx      152    Y  5.0
1      2015-01-01 01:00:00          Jan       Brooklyn     1519    Y  5.0
2      2015-01-01 01:00:00          Jan            EWR        0    Y  5.0
3      2015-01-01 01:00:00          Jan      Manhattan     5258    Y  5.0
4      2015-01-01 01:00:00          Jan         Queens      405    Y  5.0
...                    ...          ...            ...      ...  ...  ...
29096  2015-06-30 23:00:00          Jun            EWR        0    N  7.0
29097  2015-06-30 23:00:00          Jun      Manhattan     3828    N  7.0
29098  2015-06-30 23:00:00          Jun         Queens      580    N  7.0
29099  2015-06-30 23:00:00          Jun  Staten Island        0    N  7.0
29100  2015-06-30 23:00:00          Jun            NaN        3    N  7.0

        vsb  temp  dewp     slp  pcp_01  pcp_06  pcp_24   sd
0      10.0  30.0   7.0  1023.5     0.0     0.0     0.0  0.0
1      10.0  30.0   7.0  1023.5     0.0     0.0     0.0  0.0
2      10.0  30.0   7.0  1023.5     0.0     0.0     0.0  0.0
3      10.0  30.0   7.0  1023.5     0.0     0.0     0.0  0.0
4      10.0  30.0   7.0  1023.5     0.0     0.0     0.0  0.0
...     ...   ...   ...     ...     ...     ...     ...  ...
29096  10.0  75.0  65.0  1011.8     0.0     0.0     0.0  0.0
29097  10.0  75.0  65.0  1011.8     0.0     0.0     0.0  0.0
29098  10.0  75.0  65.0  1011.8     0.0     0.0     0.0  0.0
29099  10.0  75.0  65.0  1011.8     0.0     0.0     0.0  0.0
29100  10.0  75.0  65.0  1011.8     0.0     0.0     0.0  0.0

[29101 rows x 14 columns]>

In [11]:
taxi['borough'].value_counts()

Bronx            4343
Brooklyn         4343
EWR              4343
Manhattan        4343
Queens           4343
Staten Island    4343
Name: borough, dtype: int64

In [12]:
taxi.pickups.sum()

14265773

In [13]:
total_pickups = taxi['pickups'].sum()

In [14]:
taxi.groupby('borough', as_index=False).agg({'pickups': "sum"})

         borough   pickups
0          Bronx    220047
1       Brooklyn   2321035
2            EWR       105
3      Manhattan  10367841
4         Queens   1343528
5  Staten Island      6957

In [15]:
areas_pickups = taxi \
.groupby('borough', as_index=False) \
.aggregate({'pickups' : 'sum'}) \
.sort_values('pickups', ascending=False)

In [16]:
areas_pickups

         borough   pickups
3      Manhattan  10367841
1       Brooklyn   2321035
4         Queens   1343528
0          Bronx    220047
5  Staten Island      6957
2            EWR       105

In [17]:
areas_pickups.pickups.idxmin()

2

In [18]:
areas_pickups.pickups.idxmax()

3

In [19]:
lowerest_pickup_area = areas_pickups.borough[2]

In [20]:
print(lowerest_pickup_area)

EWR

money_by_city = df \
.groupby(['title', 'city'], as_index=False) \
.aggregate({'money' : 'sum'}) \
.sort_values('money', ascending=False)

In [21]:
holiday_day = taxi \
.groupby(['borough', 'hday'], as_index=False) \
.agg({'pickups' : 'mean'}) \
.sort_values('pickups', ascending=False)

In [22]:
holiday_day

          borough hday      pickups
6       Manhattan    N  2401.302921
7       Manhattan    Y  2035.928144
2        Brooklyn    N   534.727969
3        Brooklyn    Y   527.011976
9          Queens    Y   320.730539
8          Queens    N   308.899904
0           Bronx    N    50.771073
1           Bronx    Y    48.065868
10  Staten Island    N     1.606082
11  Staten Island    Y     1.497006
5             EWR    Y     0.041916
4             EWR    N     0.023467

In [23]:
pickups_by_mon_bor = taxi \
.groupby(['pickup_month', 'borough' ], as_index=False) \
.agg({'pickups' : 'sum'}) \
.sort_values('pickups', ascending=False)

In [24]:
pickups_by_mon_bor.head()

   pickup_month    borough  pickups
21          Jun  Manhattan  1995388
33          May  Manhattan  1888800
9           Feb  Manhattan  1718571
27          Mar  Manhattan  1661261
3           Apr  Manhattan  1648278

In [25]:
def temp_to_celcius(temp_f):
    return ((temp_f-32) *5.0)/(9.0)

In [26]:
taxi['temp_C'] = temp_to_celcius(taxi['temp'])

In [27]:
taxi.temp[:5]

0    30.0
1    30.0
2    30.0
3    30.0
4    30.0
Name: temp, dtype: float64

In [28]:
taxi.temp_C[:5]

0   -1.111111
1   -1.111111
2   -1.111111
3   -1.111111
4   -1.111111
Name: temp_C, dtype: float64

Celsius = ((Fahrenheit-32) *5.0)/(9.0)
 ​	
Пример работы:
> taxi['temp'][:5]
0    30.0
1    30.0
3    30.0
4    30.0
5    30.0

> taxi['temp_C'] = temp_to_celcius(taxi['temp'])
> taxi['temp_C'][:5]
0   -1.111111
1   -1.111111
3   -1.111111
4   -1.111111
5   -1.111111

In [33]:
pd.read_csv('C://data_science_materials/bookings.csv')

       Hotel;Is Canceled;Lead Time;arrival full date;Arrival Date Year;Arrival Date Month;Arrival Date Week Number;Arrival Date Day of Month;Stays in Weekend nights;Stays in week nights;stays total nights;Adults;Children;Babies;Meal;Country;Reserved Room Type;Assigned room type;customer type;Reservation Status;Reservation status_date
0       Resort Hotel;0;342;2015-07-01;2015;July;27;1;0...
1       Resort Hotel;0;737;2015-07-01;2015;July;27;1;0...
2       Resort Hotel;0;7;2015-07-01;2015;July;27;1;0;1...
3       Resort Hotel;0;13;2015-07-01;2015;July;27;1;0;...
4       Resort Hotel;0;14;2015-07-01;2015;July;27;1;0;...
...                                                   ...
119385  City Hotel;0;23;2017-08-30;2017;August;35;30;2...
119386  City Hotel;0;102;2017-08-31;2017;August;35;31;...
119387  City Hotel;0;34;2017-08-31;2017;August;35;31;2...
119388  City Hotel;0;109;2017-08-31;2017;August;35;31;...
119389  City Hotel;0;205;2017-08-29;2017;August;35;29;...

[119390 rows x 1 columns]

In [35]:
print(1,2,3,4,5, end = '\n')

1 2 3 4 5

In [38]:
list2 = [1,2,3,4,5,6]

In [44]:
print(*list2, sep = '\n')

1
2
3
4
5
6

In [45]:
pd.read_csv('C:/data_science_materials/path_1/path_2/bookings.csv')

       Hotel;Is Canceled;Lead Time;arrival full date;Arrival Date Year;Arrival Date Month;Arrival Date Week Number;Arrival Date Day of Month;Stays in Weekend nights;Stays in week nights;stays total nights;Adults;Children;Babies;Meal;Country;Reserved Room Type;Assigned room type;customer type;Reservation Status;Reservation status_date
0       Resort Hotel;0;342;2015-07-01;2015;July;27;1;0...
1       Resort Hotel;0;737;2015-07-01;2015;July;27;1;0...
2       Resort Hotel;0;7;2015-07-01;2015;July;27;1;0;1...
3       Resort Hotel;0;13;2015-07-01;2015;July;27;1;0;...
4       Resort Hotel;0;14;2015-07-01;2015;July;27;1;0;...
...                                                   ...
119385  City Hotel;0;23;2017-08-30;2017;August;35;30;2...
119386  City Hotel;0;102;2017-08-31;2017;August;35;31;...
119387  City Hotel;0;34;2017-08-31;2017;August;35;31;2...
119388  City Hotel;0;109;2017-08-31;2017;August;35;31;...
119389  City Hotel;0;205;2017-08-29;2017;August;35;29;...

[119390 rows x 1 columns]

In [48]:
pd.read_csv('bookings.csv', sep = ';')

,Hotel,Is Canceled,Lead Time,arrival full date,Arrival Date Year,Arrival Date Month,Arrival Date Week Number,Arrival Date Day of Month,Stays in Weekend nights,Stays in week nights,...,Adults,Children,Babies,Meal,Country,Reserved Room Type,Assigned room type,customer type,Reservation Status,Reservation status_date
0,Resort Hotel,0,342,2015-07-01,2015,July,27,1,0,0,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-01
1,Resort Hotel,0,737,2015-07-01,2015,July,27,1,0,0,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-01
2,Resort Hotel,0,7,2015-07-01,2015,July,27,1,0,1,...,1,0.0,0,BB,GBR,A,C,Transient,Check-Out,2015-07-02
3,Resort Hotel,0,13,2015-07-01,2015,July,27,1,0,1,...,1,0.0,0,BB,GBR,A,A,Transient,Check-Out,2015-07-02
4,Resort Hotel,0,14,2015-07-01,2015,July,27,1,0,2,...,2,0.0,0,BB,GBR,A,A,Transient,Check-Out,2015-07-03
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
119385,City Hotel,0,23,2017-08-30,2017,August,35,30,2,5,...,2,0.0,0,BB,BEL,A,A,Transient,Check-Out,2017-09-06
119386,City Hotel,0,102,2017-08-31,2017,August,35,31,2,5,...,3,0.0,0,BB,FRA,E,E,Transient,Check-Out,2017-09-07
119387,City Hotel,0,34,2017-08-31,2017,August,35,31,2,5,...,2,0.0,0,BB,DEU,D,D,Transient,Check-Out,2017-09-07
119388,City Hotel,0,109,2017-08-31,2017,August,35,31,2,5,...,2,0.0,0,BB,GBR,A,A,Transient,Check-Out,2017-09-07
119389,City Hotel,0,205,2017-08-29,2017,August,35,29,2,7,...,2,0.0,0,HB,DEU,A,A,Transient,Check-Out,2017-09-07

In [61]:
s = 'Hello world!'
p = 'my name'

In [59]:
print(s.replace(' ', '_'))

Hello_world!

In [60]:
def underscore_replace(text):
    return text.replace(' ', '_')

In [62]:
underscore_replace(p)

'my_name'

In [64]:
taxi2 = pd.read_csv('2_taxi_nyc.csv')

In [65]:
taxi2

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp 01,pcp 06,pcp 24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29096,2015-06-30 23:00:00,Jun,EWR,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29097,2015-06-30 23:00:00,Jun,Manhattan,3828,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29098,2015-06-30 23:00:00,Jun,Queens,580,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29099,2015-06-30 23:00:00,Jun,Staten Island,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29100,2015-06-30 23:00:00,Jun,NaN,3,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0

In [66]:
taxi2 = taxi2.rename(columns=underscore_replace)

In [67]:
taxi2

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp_01,pcp_06,pcp_24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29096,2015-06-30 23:00:00,Jun,EWR,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29097,2015-06-30 23:00:00,Jun,Manhattan,3828,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29098,2015-06-30 23:00:00,Jun,Queens,580,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29099,2015-06-30 23:00:00,Jun,Staten Island,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29100,2015-06-30 23:00:00,Jun,NaN,3,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0

In [69]:
taxi2.borough

0                Bronx
1             Brooklyn
2                  EWR
3            Manhattan
4               Queens
             ...
29096              EWR
29097        Manhattan
29098           Queens
29099    Staten Island
29100              NaN
Name: borough, Length: 29101, dtype: object

In [72]:
taxi2.query('borough == "Brooklyn"') \
.shape[0]

4343

In [75]:
taxi2.groupby('borough', as_index=False) \
.agg({'pickups': 'count'})

         borough  pickups
0          Bronx     4343
1       Brooklyn     4343
2            EWR     4343
3      Manhattan     4343
4         Queens     4343
5  Staten Island     4343

In [77]:
taxi2.borough.value_counts()

Bronx            4343
Brooklyn         4343
EWR              4343
Manhattan        4343
Queens           4343
Staten Island    4343
Name: borough, dtype: int64

In [109]:
taxi2.pickup_month.value_counts()

May    5058
Mar    4957
Jun    4899
Jan    4897
Apr    4798
Feb    4492
Name: pickup_month, dtype: int64

In [79]:
taxi2.pickups.sum()

14265773

In [80]:
taxi2.groupby('borough', as_index=False) \
.agg({'pickups':'sum'})

         borough   pickups
0          Bronx    220047
1       Brooklyn   2321035
2            EWR       105
3      Manhattan  10367841
4         Queens   1343528
5  Staten Island      6957

In [95]:
taxi2.groupby('borough') \
.agg({'pickups':'sum'}) \
.idxmax()

pickups    Manhattan
dtype: object

In [96]:
taxi2.groupby('borough') \
.agg({'pickups':'sum'}) \
.idxmin()

pickups    EWR
dtype: object

In [99]:
taxi2.groupby(['borough','hday']) \
.agg({'pickups':'mean'})

                        pickups
borough       hday
Bronx         N       50.771073
              Y       48.065868
Brooklyn      N      534.727969
              Y      527.011976
EWR           N        0.023467
              Y        0.041916
Manhattan     N     2401.302921
              Y     2035.928144
Queens        N      308.899904
              Y      320.730539
Staten Island N        1.606082
              Y        1.497006

In [101]:
taxi2.groupby(['borough','pickup_month']) \
.agg({'pickups':'sum'})

                            pickups
borough       pickup_month
Bronx         Apr             34617
              Feb             28694
              Jan             22461
              Jun             49006
              Mar             32232
              May             53037
Brooklyn      Apr            378095
              Feb            328650
              Jan            309011
              Jun            482466
              Mar            346726
              May            476087
EWR           Apr                10
              Feb                14
              Jan                11
              Jun                29
              Mar                14
              May                27
Manhattan     Apr           1648278
              Feb           1718571
              Jan           1455543
              Jun           1995388
              Mar           1661261
              May           1888800
Queens        Apr            216857
              Feb            185695
              Jan            159211
              Jun            286311
              Mar            219561
              May            275893
Staten Island Apr              1068
              Feb               903
              Jan               821
              Jun              1673
              Mar               975
              May              1517

In [102]:
taxi2.groupby(['borough','pickup_month']) \
.agg({'pickups':'sum'}).shape

(36, 1)

In [111]:
taxi2.groupby(['borough','pickup_month']) \
.agg({'pickups':'sum'}) \
.idxmax()

pickups    (Manhattan, Jun)
dtype: object

In [110]:
taxi2.groupby(['borough','pickup_month'], as_index=False) \
.agg({'pickups':'sum'}).shape

(36, 3)

In [118]:
taxi2.groupby(['borough','pickup_month'], as_index=False) \
.agg({'pickups':'sum'}) \
.sort_values('pickups', ascending=False).head(1)

      borough pickup_month  pickups
21  Manhattan          Jun  1995388

In [121]:
taxi2.temp.max()

89.0

In [136]:
def temp_change(temp):
    return ((temp-32) *5.0)/(9.0)

In [137]:
temp_change(taxi2.temp.min())

-16.666666666666668

In [138]:
taxi2.temp+15

0        45.0
1        45.0
2        45.0
3        45.0
4        45.0
         ...
29096    90.0
29097    90.0
29098    90.0
29099    90.0
29100    90.0
Name: temp, Length: 29101, dtype: float64

In [129]:
tempereture = [5,-6,3,8,-7,12,17,15,26,27,35]

In [135]:
temp_change(tempereture)

TypeError: unsupported operand type(s) for -: 'tuple' and 'int'

In [139]:
tempereture -5

TypeError: unsupported operand type(s) for -: 'list' and 'int'

In [140]:
for temp in tempereture:
    print(temp -5)

0
-11
-2
3
-12
7
12
10
21
22
30